Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱི་དྲུང་ནས་སོང་སྟེ། གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Sudhana, the head merchant’s son, left the presence of Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, and went to the location of the great city of Kapilavastu.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་དེ་ཉིད་བསྒོམ་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། རྒྱ་ཆེར་བྱ་བ་དང་། ནན་ཏན་དུ་བྱ་བ་དང་། ཤིན་ཏུ་སྦྱང་བ་དང་། ཡོངས་སུ་བསམ་པ་དང་། རྣམ་པར་དབྱེ་བ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འགྲོ་བའི་ཁང་བ་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་སྣང་བའི་འོད་གང་ན་བ་དེར་སོང་ངོ་།
en: While meditating on, comprehending, increasing, practicing, purifying, contemplating, and examining the bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas , he came to the assembly hall of the bodhisattvas called the Illuminating Light of the Realm of the Dharma.

source: །དེར་འགྲོ་བའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མྱེད་པའི་དཔལ་ཞེས་བྱ་བ་དེ་ལ་ཁྱིམ་གྱི་ལྷ་མོ་སྟོང་ཕྲག་བཅུ་དང་བཅས་བསུ་ནས།
en: When he arrived there, he was greeted by Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, together with ten thousand house goddesses.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: She said to Sudhana, the head merchant’s son, “We welcome you, great being who has the prowess of great wisdom and knowledge;

source: །སྐྱེས་བུ་ཆེན་པོ་ཤེས་རབ་དང་། ཡེ་ཤེས་ཆེན་པོས་རྣམ་པར་གནོན་པ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསམ་གྱིས་མྱི་ཁྱབ་པ་སྒོམ་པ་ལ་ལྷག་པར་དམྱིགས་པའི་སྨོན་ལམ་གྱི་སེམས་དང་ལྡན་པ།
en: whose mind has attained the meditation of inconceivable bodhisattva liberation;

source: ཆོས་ཡངས་པའི་གཞལ་མེད་ཁང་གི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ།
en: whose field of activity is the vast divine palace of the Dharma;

source: ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་མངོན་པར་གཞོལ་བ།
en: who enters the city of the Dharma;

source: བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ཀྱི་ཚུལ་མཐའ་ཡས་པས་སེམས་ཅན་འདུལ་བ་ལ་འཇུག་པ་རྒྱུན་མི་གཅོད་པ།
en: who is continuously engaged in guiding beings through infinite bodhisattva methods;

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: who has attained the illumination of the ocean of qualities of the tathāgatas;

source: འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་གདུལ་པ་ལ་རབ་ཏུ་སྣང་བའི་སྤོབས་པ་དང་། ཡེ་ཤེས་མངོན་དུ་གྱུར་བ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཤེས་པའི་ལུས་ཀྱིས་འགྲོ་ཞིང་རྗེས་སུ་འབྲང་བར་བྱ་བའི་སྤྱོད་པ་ལ་མངོན་དུ་གྱུར་པའི་སེམས་དང་ལྡན་པ།
en: who has the manifest knowledge and illuminating eloquence for guiding all beings; who has the motivation to manifest the conduct of a corresponding body and language that knows the conduct of all beings;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་དགའ་བ་རྒྱ་མཚོའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱ་བའི་སྨོན་ལམ་དང་ལྡན་པ།
en: who prays to increase the power of an ocean of joy in the minds of all beings;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ལམ་དུ་ཞུགས་པ།
en: and who follows the path to the comprehension of the Dharma of all the tathāgatas.

source: ཁྱོད་བྱོན་པ་ལེགས་སོ། །མིག་ཕྱིར་གླན་པ་མྱེད་པས་སྤྱོད་པ་དང་། སྤྱོད་ལམ་ཟབ་ཅིང་རྣམ་པར་དག་པའི་སྤྱོད་ཡུལ་ཅན་ཁྱོད་ལ་བལྟས་ན། ཁྱོད་ནི་རིང་པོ་མྱི་ཐོགས་པར་དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་། གསུང་དང་། ཐུགས་ཀྱི་རྒྱན་རྣམ་པར་དག་པ་བླ་ན་མྱེད་པ་རབ་ཏུ་ཐོབ་སྟེ། མཚན་དང་དཔེ་བྱད་བཟང་པོས་རབ་ཏུ་བརྒྱན་པའི་ལུས་དང་སྟོབས་བཅུའི་ཡེ་ཤེས་སྣང་བས་བརྒྱན་པའི་སེམས་ཀྱིས་འཇིག་རྟེན་དུ་རྣམ་པར་སྤྱོད་པར་འགྱུར་རོ། །ཁྱོད་ཀྱི་བརྩོན་འགྲུས་དང་རྣམ་པར་གནོན་པ་ལ་བལྟས་ན།
en: “I see that you have the field of activity of profound behavior with a steady gaze, and that therefore you are someone who will soon attain the unsurpassable pure adornments of the body, speech, and mind of the tathāgatas and will act in this world with a body adorned by the signs and features of a great being and with a mind adorned by the light of knowledge of the ten strengths.

source: ཁྱོད་ནི་རིང་པོ་མི་ཐོགས་པར་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་མངོན་དུ་གྱུར་བར་མཐོང་བ་དང་ལྡན་ཞིང་།
en: “I see that you have diligence and prowess, and that therefore you are someone who soon will have the vision of the tathāgatas of the three times;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་བ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཆོས་ཞི་བ་དང་ལྡན་པའི་གཞལ་མེད་ཁང་གི་དགའ་བ་མྱོང་བ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་ཐར་པ་ཟབ་མོར་ཆུད་པར་འགྱུར་རོ།
en: will hold the clouds of Dharmas of all the tathāgatas; will experience the joy of the divine palace of the four qualities of bodhisattva dhyānas, liberations, samādhis, and samāpattis; and will enter the profound liberation of the buddhas.

source: །དེ་ཡང་དེ་ལྟར་ཁྱོད་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། བལྟ་བ་དང་བསྙེན་བཀུར་བ་དང་། གདམས་ངག་མ་ནོར་བར་བླང་བ་དང་། དེའི་ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བའི་ཚུལ་ལ་བརྩོན་པར་བྱེད་པས་ཡོངས་སུ་མི་སྐྱོ། ཕྱིར་མི་ལྡོག །སྒྱིད་ལུག་པར་མི་འགྱུར་ཏེ།
en: “In that way, you go before kalyāṇamitras, gaze upon them, honor them, receive their teaching without error, and are dedicated to the practice of its qualities that is unwearied, irreversible, and never disheartened.

source: ཁྱོད་ལ་བགེགས་སམ། བར་དུ་གཅོད་པའམ། སྒྲིབ་པ་གང་གིས་ཀྱང་མྱི་ཚུགས་ཏེ།
en: You are unaffected by any hindrance, obstacle, or obscuration whatsoever.

source: བདུད་དམ་བདུད་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་རྣམས་ཀྱང་མདུན་ན་གནས་པ་མེད་པས་དེའི་ཕྱིར་ཁྱོད་ནི་རིང་པོར་མི་ཐོགས་པར་སེམས་ཅན་ཐམས་ཅད་དགའ་བར་བྱེད་པར་འགྱུར་རོ།
en: Neither Māra nor the māra class of deities are present before you, and therefore you will soon bring happiness to all beings.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་འགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མེད་པའི་དཔལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་ཁྱོད་ཀྱིས་ཇི་སྐད་དུ་སྨྲས་པ་དེ་ལྟར་འགྱུར་རོ། །ལྷ་མོ་ཁོ་བོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གདུང་བ་རྣམ་པར་ཞི་བས་དགའ་བར་འགྱུར་ཏེ།
en: The head merchant’s son, Sudhana, said to Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, “Goddess, I gain the highest delight in ending the torment of the kleśas for all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་ཉམ་ང་བའི་རྣམ་པར་སྨྱིན་པའི་ཕྱིར་ལྡོག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་འགྲུབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ལ་ནན་ཏན་ཏུ་བྱེད་པས་དགའ་བ་དམ་པ་ཉམས་སུ་ཚོར་བར་འགྱུར་རོ།
en: I gain the highest delight in repelling dreadful karma for all beings, in bringing happiness to all beings, and in making all beings practice faultless actions.

source: །ནམ་སེམས་ཅན་དེ་དག་ལས་དང་ཉོན་མོངས་པ་རྣམ་པ་སྣ་ཚོགས་མྱི་བདེ་བའི་སྦྱོར་བས་སེམས་རྣམ་པར་འཁྲུགས་ཤིང་ངན་སོང་དུ་ལྟུང་བར་འགྱུར་བའམ།
en: Bodhisattvas become very unhappy when beings engage in the unhappiness of various kinds of karma and kleśas, which disturbs their minds and causes them to fall into the lower existences.

source: བདེ་བའི་རྒྱུད་ན་གནས་ཀྱང་ལུས་དང་སེམས་ཀྱི་སྡུག་བསྔལ་དང་ཡིད་མྱི་བདེ་བ་སྣ་ཚོགས་ཉམས་སུ་མྱོང་བར་གྱུར་ཅིང་། མི་དགའ་བར་གནས་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཤིན་ཏུ་ཡིད་མི་བདེ་བར་འགྱུར་རོ།
en: Even if those beings remain in happier existences, they experience physical and mental sufferings and various kinds of unhappiness and remain in a state of sorrow.

source: །ལྷ་མོ་འདི་ལྟ་སྟེ། དཔེར་ན། མི་ཤིན་ཏུ་ངང་གིས་བྱམས་པ་ཞིག་ལ་བུ་གཅིག་པ་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་ཞིག་བདོག་པར་གྱུར་ལ། དེའི་ཡན་ལག་དང་ཉིང་ལག་བཅད་པ་ཞིག་མཐོང་ན་ཤིན་ཏུ་ངང་གིས་བྱམས་པའི་ཕྱིར་རབ་ཏུ་ཡིད་མི་བདེ་ཞིང་མྱི་དགའ་བར་འགྱུར་རོ།
en: “Goddess, it is like if a very loving father who has a beloved, beautiful son sees the limbs and smaller parts of his son’s body being cut off.

source: །ལྷ་མོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་འང་སེམས་ཅན་རྣམས་ལས་དང་ཉོན་མོངས་པའི་དབང་གིས་ངན་སོང་གསུམ་གྱི་རྒྱུད་དུ་ལྷུང་བ་ཞིག་མཐོང་ན་རབ་ཏུ་མི་དགའ་ལ་ཤིན་ཏུ་ཉམས་མི་བདེ་བར་འགྱུར་རོ།
en: Because he is so loving, he becomes extremely unhappy and sorrowful. “Goddess, in the same way, when a bodhisattva who is engaged in bodhisattva conduct sees beings falling into the three lower existences through the power of their karma and kleśas, the bodhisattva becomes extremely unhappy and sorrowful.

source: །གང་གི་ཚེ་སེམས་ཅན་རྣམས་ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པ་ཡང་དག་པར་ལེན་པའི་རྒྱུས་ལུས་ཞིག་ནས་བདེ་བའི་རྒྱུད་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་གྱུར་ཏམ། ལྷ་དང་མིའི་ལམ་གྱི་རྒྱུད་དུ་ལུས་དང་སེམས་ཀྱི་བདེ་བ་ཉམས་སུ་མྱོང་བ་ཞིག་ཏུ་གྱུར་ན། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་བདེ་བ་དང་ལྡན་ཞིང་། ཉམས་བདེ་བ་དང་ཡིད་དགའ་བ་དང་། རབ་ཏུ་སྤྲོ་བ་དང་། དགའ་བའི་ཡིད་ཉམས་སུ་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: “The bodhisattvas are happy, glad, joyful, delighted, and pleased when beings are reborn into happy existences when their bodies are destroyed, or when they experience physical and mental happiness in a divine or human existence as the result of their having adopted good physical, vocal, and mental conduct.

source: །ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདག་གི་དོན་གྱི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་ཅིང་དོན་དུ་གཉེར་བ་མ་ཡིན་ཏེ། འཁོར་བའི་དགའ་བ་དང་། བདེ་བ་སྣ་ཚོགས་ཉམས་སུ་མྱོང་བར་བྱ་བའི་ཕྱིར་མ་ཡིན།
en: “Goddess, the bodhisattvas do not aspire to and are not dedicated to omniscience for their own sake or in order to experience the various joys and pleasures of saṃsāra.

source: འདོད་པའི་ཁམས་སུ་གཏོགས་པའི་དགའ་བ་རྣམ་པ་ཐ་དད་པར་སྣ་ཚོགས་དོན་དུ་གཉེར་བས་མ་ཡིན།
en: It is not from dedication to the various different kinds of joys within the desire realm.

source: འདུ་ཤེས་དང་སེམས་དང་ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་བའི་དབང་གིས་མ་ཡིན།
en: It is not through the power of mistaken perception, motivation, or views.

source: ཀུན་ཏུ་སྦྱོར་བ་དང་། འཆིང་བ་དང་། བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་འཁོར་བའི་དབང་དུ་གྱུར་པས་མ་ཡིན།
en: It is not through the power of involvement, bondage, predispositions, or being overwhelmed.

source: སྲེད་པ་དང་ལྟ་བའི་དབང་དུ་གྱུར་པས་མ་ཡིན།
en: It is not through the power of the view of craving.

source: སེམས་ཅན་སྣ་ཚོགས་དང་འདུ་ཞིང་འཛི་བའི་དགའ་བའི་འདུ་ཤེས་ཀྱིས་སེམས་རྣམ་པར་འཕེལ་བས་མ་ཡིན།
en: It is not through the increase of a mind that conceives of the joys of crowds and the gatherings of various beings.

source: བསམ་གཏན་གྱི་དགའ་བ་དང་བདེ་བ་མྱོང་བ་ཡོངས་སུ་ཆགས་པས་མ་ཡིན།
en: It is not through attachment to the experiences of the joy and bliss of dhyāna.

source: སྒྲིབ་པ་སྣ་ཚོགས་ཀྱིས་བསྒྲིབས་ཤིང་འཁོར་བའི་རྒྱུད་ན་འགྲོ་ལྡོག་པ་མ་ཡིན་གྱི།
en: It is not going around and around in the continuity of saṃsāra while being obscured by various obscurations.

source: ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་འཁོར་བའི་རྒྱ་མཚོ་ན་འཁོད་ཅིང་། སྡུག་བསྔལ་དཔག་ཏུ་མྱེད་པས་ཤིན་ཏུ་མནར་བ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་ཅིང་།
en: “Goddess, the bodhisattvas have great compassion for beings who are in the ocean of saṃsāra and who are tormented by immeasurable sufferings.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབས་ཏེ།
en: They make great prayers to gather to themselves all beings.

source: དེ་དག་སྙིང་རྗེ་ཆེན་པོས་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་ཤུགས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་བརྩོན་ཞིང་འཁོར་བ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་སྣང་ངོ་།
en: Through the power of having made those prayers with great compassion, they are dedicated to ripening and guiding beings, and they appear carrying out bodhisattva conduct in saṃsāra.

source: །དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་དོན་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྒྲིབ་པ་མེད་པ་ཡོངས་སུ་ཚོལ་ཞིང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ།
en: In order to eliminate all the obscurations of beings, they seek the unobscured wisdom of omniscience and make prayers to serve and make offerings to all the tathāgatas.

source: །དེ་དག་དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་སྨོན་ལམ་གྱི་དབང་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་ཡོངས་སུ་སྐྱོ་བ་མྱེད་དེ།
en: Through the power of their prayers to serve and make offerings to all the tathāgatas, they are never disheartened in their practice of bodhisattva conduct.

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པའི་ཚེ། ཀུན་ནས་ཉོན་མོངས་པའི་ཞིང་མཐོང་ན། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ།
en: When they are practicing bodhisattva conduct and see a realm that is completely defiled, they make the prayer to purify all buddha realms.

source: །ཀུན་ནས་ཉོན་མོངས་པའི་ཞིང་ཡོངས་སུ་སྦྱོང་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་མཆེད་སྣ་ཚོགས་མཐོང་བར་གྱུར་པའི་ཚེ། ཆོས་ཀྱི་སྐུ་ཐ་དད་པ་མེད་ཅིང་བླ་ན་མྱེད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ།
en: When they are purifying defiled realms and see the various āyatanas of all beings, they make the prayer to purify the Dharma body that is undifferentiated and unsurpassable.

source: །སེམས་ཅན་རྣམས་ཀྱི་ལུས་དང་ངག་དང་སེམས་ཀུན་ནས་ཉོན་མོངས་པ་དང་ལྡན་པར་མཐོང་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་རྒྱན་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ།
en: When they see the defiled bodies, speech, and minds of beings, they make the prayer to purify the bodies, speech, and minds that adorn all beings.

source: །སེམས་ཅན་སྐྱེ་མཆེད་མ་ཚང་བ་དང་། སེམས་ཡོངས་སུ་མ་དག་པ་མཐོང་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་ཡོངས་སུ་སྦྱོང་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པས་ཡོངས་སུ་སྐྱོ་བ་མེད་དོ།
en: When they see the incomplete āyatanas and impure minds of beings, they purify the minds and conduct of all beings and are never disheartened in carrying out bodhisattva conduct.

source: །ལྷ་མོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་སེམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཐའ་དང་དབུས་མེད་པ་ལ་སྤྱོད་དེ།
en: “Goddess, in that way, with minds that are never disheartened, the bodhisattvas carry out vast bodhisattva conduct without end or middle.

source: དེ་ལྟར་སྤྱོད་པ་ནི་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་བསྐྱེད་པས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་རྒྱན་དུ་གྱུར་པ་ཡིན།
en: With that kind of conduct they are adornments of the world because they create the good fortune of devas and humans.

source: བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལ་རབ་ཏུ་འགོད་པའི་ཕྱིར་ཕ་དང་མར་གྱུར་པ་ཡིན།
en: They are like parents because they establish beings in the aspiration for enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་དུ་འཛུད་པས་མ་མ་ལྟ་བུར་གྱུར་པ་ཡིན།
en: They are like nurses because they bring beings onto the bodhisattva path.

source: ངན་སོང་གི་གཡང་སའི་འཇིགས་པ་ལས་བསྲུང་བའི་ཕྱིར་ལྷན་ཅིག་སྐྱེས་པའི་ལྷ་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བ་ལྟ་བུར་གྱུར་པ་ཡིན།
en: They are like connate deities, who are deities that always accompany a being because they protect beings from the terror of the abyss of the lower existences.

source: འཁོར་བའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བའི་ཕྱིར་མཉན་པ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་ཡིན།
en: They are like great ferrymen because they free beings from the ocean of saṃsāra.

source: བདུད་དང་ཉོན་མོངས་པའི་འཇིགས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་ཕྱིར་སྐྱབས་སུ་གྱུར་པ་ཡིན།
en: They are refuges because they repel all the terrors of the māras and kleśas.

source: ཤིན་ཏུ་བསིལ་བའི་རང་བཞིན་ཉེ་བར་སྟོབས་པས་གནས་སུ་གྱུར་པ་ཡིན། སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་འཇུག་པར་བྱེད་པས་མུ་སྟེགས་སུ་གྱུར་པ་ཡིན།
en: They are shelters because they bring beings to a state of complete tranquility. They are bathing places because they bring beings into the ocean of all buddhas.

source: ཆོས་རིན་པོ་ཆེའི་གླིང་དུ་སྐྱེལ་བས་མགོན་བྱེད་པར་གྱུར་པ་ཡིན།
en: They are protectors because they escort beings to the island of the jewels of the Dharma.

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་མེ་ཏོག་གིས་སེམས་ཡོངས་སུ་རྒྱས་པར་བྱེད་པས་མེ་ཏོག་ཏུ་གྱུར་པ་ཡིན།
en: They are flowers because their minds have blossomed with all the qualities of buddhahood.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་འོད་ཡངས་པ་རབ་ཏུ་འགྱེད་པས་རྒྱན་དུ་གྱུར་པ་ཡིན།
en: They are adornments because they radiate the light of merit and wisdom.

source: ཀུན་ནས་མཛེས་པས་དགའ་བ་དང་བདེ་བ་དམ་པ་བྱེད་པ་ཡིན།
en: They bring the highest delight and happiness because they are beautiful.

source: ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ལ་ནན་ཏན་ཏུ་བྱེད་པས་ཕྲད་ན་ལེགས་པ་ཡིན།
en: They are excellent to meet because they are dedicated to faultless actions.

source: ཡན་ལག་དམ་པ་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་ཚང་བའི་ལུས་དང་ལྡན་པས་ཀུན་ཏུ་བཟང་བ་ཡིན།
en: They are completely good because they possess bodies that are complete in having all aspects of excellent limbs.

source: བལྟ་ན་མྱི་མཐུན་པ་མྱེད་པས་གཏང་མི་བྲ་བའི་གཟུགས་དང་ལྡན་པ་ཡིན།
en: They have charming forms because the sight of them is without anything disagreeable.

source: ཡེ་ཤེས་ཀྱི་འོད་ཟེར་རབ་ཏུ་འགྱེད་པའི་ཕྱིར་འོད་བྱེད་པ་ཡིན།
en: They bring light because they radiate the light rays of wisdom.

source: ཆོས་ཀྱི་སྒྲོན་མ་འཛིན་པའི་ཕྱིར་སྣང་བ་བྱེད་པ་ཡིན།
en: They bring illumination because they hold the torch of the Dharma.

source: བྱང་ཆུབ་ཀྱི་བསམ་པ་ཡོངས་སུ་དག་པར་བྱེད་པའི་ཕྱིར་གསལ་བར་བྱེད་པ་ཡིན།
en: They bring clarity because they purify the motivation for enlightenment.

source: བདུད་ཀྱི་ལས་རྣམ་པར་བཟློག་པའི་ཕྱིར་དམག་དཔོན་དུ་གྱུར་བ་ཡིན།
en: They are generals because they repel the activities of the māras.

source: ཤེས་རབ་ཀྱི་འོད་གཟེར་གྱི་དྲ་བ་རབ་ཏུ་སྣང་བ་འགྱེད་པའི་ཕྱིར་ཉི་མར་གྱུར་པ་ཡིན།
en: They are suns because they radiate a net of the light rays of wisdom.

source: ཆོས་ཀྱི་ནམ་མཁའ་ལ་བློའི་ཟླ་བ་འཆར་བར་བྱེད་པས་ཟླ་བར་གྱུར་པ་ཡིན། འགྲོ་བ་ཐམས་ཅད་དུ་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོའི་ཆར་འབབས་པས་སྤྲིན་དུ་གྱུར་པ་ཡིན་ཏེ།
en: They are moons because they rise as moons of realization in the sky of the Dharma. They are clouds because they send down rain from great clouds of Dharma onto all beings.

source: ལྷ་མོ་དེ་ལྟར་ནན་ཏན་དུ་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་བ་ཡིན་ནོ།
en: “Goddess, the bodhisattvas who practice in that way are a delight for all beings.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མེད་པའི་དཔལ་ཁྱིམ་གྱི་ལྷ་མོ་སྟོང་ཕྲག་བཅུ་དང་བཅས་པས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། བདུག་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་དང་། རིན་པོ་ཆེའི་རྒྱན་གྱི་ཆར་ཡིད་ཀྱི་རང་བཞིན་མངོན་པར་ཕབ་སྟེ།
en: Then Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, together with ten thousand goddesses of the home, sent down onto Sudhana, the head merchant’s son, a rain of flowers, garlands, incense, powders, ointments, and precious jewelry that transcended divine materials.

source: ཀུན་ནས་བསྐོར་ཅིང་རྗེས་སུ་འབྲངས་ནས། བྱང་ཆུབ་སེམས་དཔའི་ཁང་པར་འགྲོ་བའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Encircling him and following him as he entered the assembly hall of the bodhisattvas, they praised him with these verses:

source: །བྱང་ཆུབ་རྫོགས་པར་ཐུགས་བསྐྱེད་ཅིང་།
en: “Having developed the aspiration for enlightenment

source: །སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེ་བས།
en: Out of love for all beings,

source: །རྒྱལ་བ་ཡེ་ཤེས་ཉི་མ་རྣམས།
en: The jinas, the suns of wisdom,

source: །བར་འགའ་ཞིག་ན་འཇིག་རྟེན་འབྱུང་།
en: Sometimes appear in the world.

source: །བསྐལ་པ་བྱེ་བ་མང་པོས་ཀྱང་།
en: “Even in many millions of kalpas

source: །ཁྱོད་ཀྱི་ཞལ་མཐོང་ཤིན་ཏུ་དཀའ།
en: It is difficult to see your face. Your wisdom is a great sun

source: །འཇིག་རྟེན་མ་རིག་མདོངས་པ་ལ།
en: In the world blinded by ignorance.

source: །ཁྱོད་ཀྱི་ཡེ་ཤེས་གཉི་ཆེན་ཡིན། །མྱི་ཤེས་རབ་རིབ་བསྒྲིབས་པ་ཡི།
en: “Great compassion arose in you

source: །འཇིག་རྟེན་ཕྱིན་ཅི་ལོག་གཟིགས་ནས།
en: When you saw the world in error,

source: །ཐུགས་རྗེ་ཆེན་པོ་རབ་བསྐྱེད་དེ།
en: Obscured by the darkness of unknowing,

source: །ཁྱོད་ནི་རང་བྱུང་ཉིད་དུ་ཞུགས།
en: And you spontaneously appeared in it and remained.

source: །ཁྱོད་ཀྱི་དགོངས་པ་རྣམ་དག་པས།
en: “With your pure motivation, you are dedicated

source: །སངས་རྒྱས་བྱང་ཆུབ་དོན་དུ་བརྩོན།
en: To attaining the enlightenment of buddhahood.

source: །དགེ་བཤེས་བསྙེན་བཀུར་བསྟེན་མཛད་ཅིང་།
en: You serve and depend on kalyāṇamitras

source: །ལུས་སྲོག་ཕངས་པར་མཛད་མི་མངའ།
en: Without regard for your own body and life.

source: །ཁྱོད་ནི་འཇིག་རྟེན་རྟེན་མི་མངའ།
en: “You have no reliance on this world.

source: །འདུ་འཛི་མི་མངའ་གནས་མི་མངའ།
en: You have no location and no preoccupations.

source: །འདྲེས་པ་མ་མཆིས་མི་རྟེན་པས།
en: You have no entanglements and no abode.

source: །དགོངས་པ་ཐོགས་མེད་ནམ་མཁའ་བཞིན།
en: Your motivation is like space, without impediment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་མཛད་ཅིང་།
en: “As you practice bodhisattva conduct

source: །བསོད་ནམས་དཀྱིལ་འཁོར་འོད་བཟང་བས།
en: With the brilliant light of a field of merit,

source: །ཡེ་ཤེས་སྒྲོན་མ་རབ་འགྱེད་པ།
en: Your radiant torch of wisdom

source: །འཇིག་རྟེན་ཚད་མེད་ཀུན་ཏུ་འཆར།
en: Shines within countless worlds.

source: །འཇིག་རྟེན་ནས་ཀྱང་འཕགས་མི་མཛད།
en: “You are not above the world,

source: །འཇིག་རྟེན་ཆོས་ཀྱིས་ཡོང་མྱི་འགོ།
en: But you are unstained by worldly qualities.

source: །ཆགས་པ་མེད་པར་འཇིག་རྟེན་སྤྱོད།
en: You act in the world without impediment,

source: །མཁའ་ལ་སེར་བུ་ཇི་བཞིན་ནོ། །བསྐལ་པའི་མེ་འབར་མེ་བཞིན་དུ།
en: Like the breezes moving through the sky.

source: །རྟག་ཏུ་འབར་བས་རབ་ཏུ་བརྩོན།
en: “You are dedicated to constantly blazing

source: །མེ་ལྟ་བུ་ཡི་བརྩོན་འགྲུས་ཀྱིས།
en: Like the burning at the kalpa’s end.

source: །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པར་མཛད།
en: You practice the bodhisattva conduct With the ardor of the fire that ends a kalpa.

source: །སེང་གེ་བཞིན་དུ་ཤིན་ཏུ་དཔའ།
en: “You have great courage, like a lion.

source: །བརྩོན་འགྲུས་རྣམ་པར་གནོན་པ་བརྟན།
en: With strong, diligent prowess

source: །ཡེ་ཤེས་རྣམ་པར་གནོན་དང་ལྡན།
en: You have attained the prowess of wisdom

source: །གཞན་གྱིས་ཐུབ་པ་མེད་པར་སྤྱོད།
en: With a practice that is invincible. “Through honoring the kalyāṇamitras,

source: །ཆོས་དབྱིངས་རྒྱ་མཚོ་འདི་དག་ན།
en: You, here, have entered into

source: །རྒྱ་མཚོའི་ཚུལ་རྣམས་ཇི་སྙེད་པ།
en: The ocean of all the different ways

source: །དེར་ཡང་དགེ་བཤེས་བསྙེན་བཀུར་བས། །དཔའ་བོ་ཁྱོད་ནི་འཇུག་པར་འགྱུར།
en: Within the ocean of the realm of the Dharma.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བགྲོ་བའི་ཁང་པའི་ལྷ་མོ་མྱ་ངན་མེད་པའི་དཔལ་གྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ།
en: In that way, Aśokaśrī, the goddess of the assembly hall of the bodhisattvas, praised in verse Sudhana, the head merchant’s son, while following him out of a yearning for the Dharma.

source: དེ་འགྲོ་བའི་ཕྱི་བཞིན་ཆོས་འདོད་པའི་དོན་དུ་འབྲང་བར་གྱུར་ཏོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བགྲོ་བའི་ཁང་པ་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་སྣང་བའི་འོད་དུ་ཕྱིན་ཏེ།
en: Sudhana, the head merchant’s son, went into the assembly hall of the bodhisattvas called the Illuminating Light of the Realm of the Dharma.

source: ནང་དུ་སོང་ནས་ཤཱཀྱའི་བུ་མོ་གོ་བ་མཐོང་བར་འདོད་དེ་ཀུན་ཏུ་བལྟས་ན་ཤཱཀྱའི་བུ་མོ་གོ་པ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བགྲོ་བའི་ཁང་པ་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་སྣང་བའི་འོད་ཀྱི་དབུས་ན།
en: When he had entered, wishing to find the Śākya maiden Gopā, he looked everywhere. He saw the Śākya maiden Gopā in the center of the assembly hall of the bodhisattvas called the Illuminating Light of the Realm of the Dharma.

source: སྟན་རིན་པོ་ཆེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གནས་སྣང་བར་བྱེད་པའི་གཟུགས་བརྙན་གྱི་པདྨོའི་སྙིང་པོ་ཅན་ཞིག་ལ་བུད་མེད་རྒྱལ་པོའི་རིགས་སུ་བྱུང་བ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་དགེ་བའི་རྩ་བའི་སྐལ་བ་མཉམ་པ།
en: She was seated upon a precious throne that had in its center a lotus with a form that illuminated all the abodes of bodhisattvas, and she was encircled by an entourage of eighty-four thousand women of royal families, who all had equally the roots of merit from the past practice of bodhisattva conduct;

source: སྔོན་སྦྱིན་པའི་ཡོངས་སུ་བསྡུ་བས་ཤིན་ཏུ་བསྡུས་པ།
en: who in the past had attracted gatherings of beings through acts of generosity;

source: ཚིག་སྙན་ཅིང་འཇམ་པར་སྨྲ་བའི་ངང་ཚུལ་དང་ལྡན་པ།
en: who had a way of speaking with pleasant and gentle words;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ། དོན་མངོན་དུ་བྱ་བས་ཤིན་ཏུ་བསྡུས་པ།
en: who cared for beings through causing them to focus on the goal of omniscience;

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་བསྒྲུབ་པ་ལ་དོན་མཐུན་པས་ཤིན་ཏུ་བཟུང་བ།
en: who cared for beings in accord with the realizations of the buddhas and the bodhisattvas;

source: སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བས་བུ་དང་བུ་མོ་ཡོངས་སུ་གཟུང་བའི་ཚུལ་བཅངས་པ།
en: who with all actions inspired by great compassion cared for beings as if they were their sons and daughters;

source: བྱམས་པ་ཆེན་པོ་དང་ལྡན་པའི་རང་གི་ཁྱིམ་ཐབ་ཀྱི་རྗེས་སུ་འབྲང་བ་ཡོངས་སུ་དག་པར་བྱས་པ།
en: who with great love followed and purified their spouses;
